[
{"CostPrice":"599.00", "Description":"Declare your love with this 0.33 carat total weight bridal set, created in 10kt white gold. The engagement ring features a framed quad top, and the diamond set wedding band has been perfectly moulded to sit beside it. This is a combination that is sure to take her breath away.", "Brand":"BRIDAL", "ProductName":"Bridal Set with 0.33 Carat TW of Diamonds in 10kt White Gold"},
{"CostPrice":"1029.00", "Description":"Make your dreams come true with this gorgeous 0.18 carat total weight diamond ring. Featuring fine detailing and round brilliant diamonds, claw set in 14kt white gold, this ring will bring a classic sparkle to your life.", "Brand":"BRIDAL", "ProductName":"1 Carat TW Diamond Bridal Set"},
{"CostPrice":"1079.00", "Description":"Exquisitely styled, this gorgeous bridal set will be adored forever.", "Brand":"BRIDAL", "ProductName":"Bridal Set with 0.20 Carat TW of Diamonds in 10kt White Gold"},
{"CostPrice":"1129.00", "Description":"Your bride to be is sure to say yes with this stunning diamond bridal set featuring a 1/4 carat of diamonds.", "Brand":"BRIDAL", "ProductName":"Promises of Love Bridal Set with 1/4 Carat TW of Diamonds in 10kt White Gold"},
{"CostPrice":"1259.00", "Description":"Give her your heart and then say 'I do' with this 0.33 carat total weight diamond ring, that says it all. Featuring a stunning heart shaped centrepiece comprised of claw-set round brilliant diamonds, and further round brilliant diamond shoulders for extra sparkle, this 10kt white gold bridal set also includes a 10kt white gold wedding band, to complete the picture.", "Brand":"BRIDAL", "ProductName":"Promises of Love Bridal Set with 0.33 Carat TW of Diamonds in 10kt White Gold"},
{"CostPrice":"850.00", "Description":"Make your big day just that little bit more special with this stunning 0.15 carat total weight diamond wedding band. Featuring a contoured design created in 14kt white gold, and lined with round brilliant diamonds, it will perfectly complement your engagement ring. Exclusive to the Evermore Colourless Collection.", "Brand":"EVERMORE COLOURLESS", "ProductName":"Wedding Band with 0.15 Carat TW of Diamonds in 14kt White Gold"},
{"CostPrice":"950.00", "Description":"Show the world what love is with this stunning wedding band showcasing 0.16 carat total weight of round brilliant diamonds. Contoured to sit perfectly next to your engagement ring, this 14kt white gold band is just what you've been looking for. Exclusive to the Evermore Colourless Collection.", "Brand":"EVERMORE COLOURLESS", "ProductName":"Evermore Colourless Wedding Band with 0.16 TW of Diamonds in 14kt White Gold"},
{"CostPrice":"1000.00", "Description":"This simply stunning 0.173 carat total weight diamond wedding band will sparkle and shine for a lifetime. Created in luxurious 14kt white gold, and pave set with a row of round brilliant diamonds, this is a piece that is made to be treasured for a lifetime. Exclusive to the Evermore Colourless Collection.", "Brand":"EVERMORE COLOURLESS", "ProductName":"Evermore Colourless Wedding Band with 0.17 TW of Diamonds in 14kt White Gold"},
{"CostPrice":"1400.00", "Description":"The perfect finishing touch for your big day, this 0.30 carat total weight diamond wedding band will seal your promise. Created in 14kt white gold and set with round brilliant diamonds, your love will shine through. Exclusive to the Evermore Colourless Collection.", "Brand":"EVERMORE COLOURLESS", "ProductName":"Evermore Colourless Wedding Band with 0.30 TW of Diamonds in 14kt White Gold"},
{"CostPrice":"1999.00", "Description":"Your love will is sure to come alive with this 1/3 carat diamond solitaire ring. Featuring a single round brilliant diamond claw set in the 14kt white gold band, this rare stone has been hand selected from the 1% of diamonds certified colourless. Exclusive to the Evermore Colourless Collection.", "Brand":"EVERMORE COLOURLESS", "ProductName":"Evermore Colourless Solitaire Engagement Ring with a 1/3 Carat Diamond in 14kt White Gold"},
{"CostPrice":"229.00", "Description":"Showcase your flair for fashion with this sterling silver snake ring. Created to look like a snake coiled around your finger, the scale patterned body and enhanced black diamond details bring this piece to life.", "Brand":"CITY LIGHTS", "ProductName":"City Lights Ring with Enhanced Black Diamonds in Sterling Silver"},
{"CostPrice":"799.00", "Description":"Your new favourite fashion accessory, this 1/2 carat total weight white and enhanced black diamond ring is right on trend. The contrasting diamonds are set in a crossover design crafted from sterling silver, and will make a gorgeous addition to your jewellery collection.", "Brand":"CITY LIGHTS", "ProductName":"City Lights Ring with 1/2 Carat TW of White & Enhanced Black Diamonds in Sterling Silver"},
{"CostPrice":"379.00", "Description":"Stand out from the crowd with this irresistible 0.16 carat total weight diamond ring. Featuring a unique heart design set with white diamonds, and enhanced purple diamonds amid black rhodium, this unique ring is sure to turn heads.", "Brand":"CITY LIGHTS", "ProductName":"City Lights Ring with 0.16 Carat TW of White & Enhanced Purple Diamonds in Sterling Silver"},
{"CostPrice":"349.00", "Description":"There's so much to love with this 0.38 carat total weight diamond ring. Expertly crafted in sterling silver, the striking design is claw set with alternating rows of white and enhanced blue diamonds to create a glittering look that will take you effortlessly from day to night.", "Brand":"CITY LIGHTS", "ProductName":"City Lights Ring with 0.38 Carat TW of White & Enhanced Blue Diamonds in Sterling Silver"},
{"CostPrice":"159.00", "Description":"A gorgeous treat, this enhanced black diamond ring is full of meaning. The sterling silver design features a trio of overlapping hearts and will make a beautiful gift for yourself or a loved one. Exclusive to the City Lights Collection.", "Brand":"CITY LIGHTS", "ProductName":"City Lights Ring with Enhanced Black Diamonds in Sterling Silver"},
{"CostPrice":"1200.00", "Description":"Love her now and forever with this gorgeous 1/4 carat total weight diamond GrandAdagio wedding band. Perfectly contoured, and featuring a row of round brilliant diamonds set in 14kt white gold, it will be a stunning reminder of your love. Exclusive to the Sir Michael Hill Designer Bridal Collection.", "Brand":"DESIGNER BRIDAL", "ProductName":"Sir Michael Hill Designer GrandAdagio Wedding Band with 1/4 Carat TW of Diamonds in 14kt White Gold"},
{"CostPrice":"1300.00", "Description":"Your love will shine with this 0.36 carat total weight diamond wedding band. Set with a row of round brilliant diamonds, this 14kt white gold band will tell your love story in style. Exclusive to the Sir Michael Hill Designer Bridal Collection.", "Brand":"DESIGNER BRIDAL", "ProductName":"Sir Michael Hill Designer GrandAllegro Wedding Band with 0.36 Carat TW of Diamonds in 14kt White Gold"},
{"CostPrice":"1329.00", "Description":"Delicate and beautiful, this 0.23 carat total weight diamond GrandAllegro wedding band signifies the start of your life together. Featuring a row of glittering round brilliant diamonds, claw set into the fine 14kt white gold band, it doesn't get more perfect than this. Exclusive to the Sir Michael Hill Designer Bridal Collection.", "Brand":"DESIGNER BRIDAL", "ProductName":"Sir Michael Hill Designer GrandAllegro Wedding Band with 0.23 Carat TW of Diamonds in 14kt White Gold"},
{"CostPrice":"1350.00", "Description":"Expertly crafted from 14kt white gold, this 0.31 carat total weight diamond GrandAllegro wedding band will enchant the one you love. Claw set with a row of sparkling round brilliant diamonds, it will complete your special day. Exclusive to the Sir Michael Hill Designer Bridal Collection.", "Brand":"DESIGNER BRIDAL", "ProductName":"Sir Michael Hill Designer GrandAllegro Wedding Band with 0.31 Carat TW of Diamonds in 14kt White Gold"},
{"CostPrice":"1350.00", "Description":"Say forever with this 0.31 carat total weight diamond GrandAria wedding band. The classically styled band has been created in 14kt white gold and features a row of claw set, round brilliant diamonds. Exclusive to the Sir Michael Hill Designer Bridal Collection.", "Brand":"DESIGNER BRIDAL", "ProductName":"Sir Michael Hill Designer GrandAria Wedding Band with 0.31 Carat TW of Diamonds in 14kt White Gold"}
]
